[
  {
    "year": 1640,
    "description": "Negro indentured servant John Punch ran away and received a life sentence in Virginia; his white counterparts only received three-year sentences",
    "height": 0
  },
  {
    "year": 1641,
    "description": "Massachusetts authorized slavery with legislation",
    "height": 0
  },
  {
    "year": 1660,
    "description": "Virginia specifically punished indentured servants who ran away with Negroes slaves",
    "height": 0
  },
  {
    "year": 1662,
    "description": "Virginia determined birthright of Negroes based on the status of the mother rather than the father, as had been the British custom for centuries",
    "height": 0
  },
  {
    "year": 1680,
    "description": "Virginia enacted the first major slave codes",
    "height": 0
  },
  {
    "year": 1705,
    "description": "Virginia relegated slaves, Indians, and mulattos to the status of property",
    "height": 0
  },
  {
    "year": 1776,
    "description": "Declaration of Independence signed",
    "height": 0
  },
  {
    "year": 1781,
    "description": "Quock Walker v. Jennison\n (Massachusetts) relied on the Declaration of Rights, which ultimately led to the abolition of slavery in 1783 there",
    "height": 0
  },
  {
    "year": 1785,
    "description": "New York passed legislation for the gradual emancipation of slaves",
    "height": 0
  },
  {
    "year": 1788,
    "description": "U.S. Constitution is ratified by eleven states",
    "height": 0
  },
  {
    "year": 1789,
    "description": "George Washington, a slave owner, inaugurated as the first president of the United States ",
    "height": 0
  },
  {
    "year": 1791,
    "description": "“Bill of Rights” added to U.S. Constitution; Virginia ratified on December 15, 1791",
    "height": 0
  },
  {
    "year": 1820,
    "description": "Missouri Compromise created rules for the expansion of slavery into western territories and prohibited slavery north of the 36° 30´ latitude except in Missouri",
    "height": 0
  },
  {
    "year": 1841,
    "description": "Former President John Quincy Adams defended Africans aboard the Spanish ship \nAmistad",
    "height": 0
  },
  {
    "year": 1850,
    "description": "Fugitive Slave Act of 1850 required citizens to assist in the return of escaped slaves to their owners ",
    "height": 0
  },
  {
    "year": 1850,
    "description": "Roberts v. City of Boston\n (Massachusetts) found no constitutional impediment to segregated schools",
    "height": 1
  },
  {
    "year": 1854,
    "description": "Kansas-Nebraska Act repealed the Missouri Compromise, allowing slavery in the northern territories",
    "height": 0
  },
  {
    "year": 1857,
    "description": "Dred Scott v. Sanford\n (Missouri) declared that all blacks—slaves as well as free—were not and could never become citizens of the United States",
    "height": 0
  },
  {
    "year": 1862,
    "description": "Federal emancipation of slaves in the District of Columbia",
    "height": 0
  },
  {
    "year": 1863,
    "description": "Emancipation Proclamation took effect",
    "height": 0
  },
  {
    "year": 1864,
    "description": "Fugitive Slave Act repealed",
    "height": 0
  },
  {
    "year": 1865,
    "description": "Thirteenth Amendment to the U.S. Constitution abolished slavery",
    "height": 0
  },
  {
    "year": 1865,
    "description": "Act to Establish a Bureau for the Relief of Freedmen and Refugees",
    "height": 1
  },
  {
    "year": 1866,
    "description": "Civil Rights Act of 1866 guaranteed equal rights under law for all people who lived within the jurisdiction of the United States ",
    "height": 0
  },
  {
    "year": 1868,
    "description": "Fourteenth Amendment to the U.S. Constitution granted citizenship to all people born or naturalized in the United States and prohibited states from denying any person the equal protection of the laws or depriving any person of life, liberty, or property without due process of law",
    "height": 0
  },
  {
    "year": 1870,
    "description": "Fifteenth Amendment to the U.S. Constitution granted African American men the right to vote",
    "height": 0
  },
  {
    "year": 1870,
    "description": "Three Enforcement Acts gave the federal government substantial authority to prosecute those who violated the civil and political rights of African Americans, especially members of the Ku Klux Klan ",
    "height": 1
  },
  {
    "year": 1873,
    "description": "Slaughterhouse Cases\n limited the Constitutional significance of the 14th Amendment’s privileges and immunities clause by interpreting the clause as only protecting rights of national citizenship from actions of state government",
    "height": 0
  },
  {
    "year": 1873,
    "description": "Bradwell v. Illinois\n rejected a woman’s claim that the Fourteenth Amendment required the state to allow her to practice law in the first sex discrimination case heard by the U.S. Supreme Court",
    "height": 1
  },
  {
    "year": 1875,
    "description": "Civil Rights Act of 1875 guaranteed African Americans equal treatment in public accommodations, public transportation, and prohibited their exclusion from jury service ",
    "height": 0
  },
  {
    "year": 1875,
    "description": "Minor v. Happersett\n (Missouri) held that a state could constitutionally forbid a woman from voting",
    "height": 1
  },
  {
    "year": 1883,
    "description": "Civil Rights Cases\n heard by the U.S. Supreme Court declared parts of the 1875 Civil Rights Act unconstitutional, including the prohibition of racial discrimination in inns, public conveyances, and places of public amusement",
    "height": 0
  },
  {
    "year": 1896,
    "description": "Plessy v. Ferguson\n (Louisiana) upheld the constitutionality of a Louisiana statute that required railroads to provide “equal but separate accommodations for the white and colored races”",
    "height": 0
  },
  {
    "year": 1903,
    "description": "Giles v. Harris\n (Alabama) refused to order the board of registrars to register an African American to vote in part because the court concluded that unless it could actually supervise elections, it was unable to force white Alabamans to allow African Americans to vote",
    "height": 0
  },
  {
    "year": 1906,
    "description": "Hodges v. United States\n (Arkansas) reversed a conviction against whites who had ejected “citizens of the United States of African descent” from their jobs; the decision narrowed the congressional civil rights authority under the Thirteenth Amendment",
    "height": 0
  },
  {
    "year": 1910,
    "description": "Franklin v. State of South Carolina\n affirmed the judgment of the South Carolina Supreme Court to execute African American Pink Franklin for the killing of a white constable, H. E. Valentine. Franklin shot Valentine when he came to arrest Franklin for violating a peonage-based contract for work",
    "height": 0
  },
  {
    "year": 1911,
    "description": "Bailey v. State of Alabama\n invalidated, based on the Thirteenth Amendment, a law that facilitated “debt peonage,” a form of involuntary servitude",
    "height": 0
  },
  {
    "year": 1913,
    "description": "Guinn v. United States\n (Oklahoma) deemed that state constitutional provisions permitting “grandfather clauses” for passing literacy tests as a voting requirement were unconstitutional",
    "height": 0
  },
  {
    "year": 1917,
    "description": "Buchanan v. Warley\n (Kentucky) held residential racial segregation unconstitutional",
    "height": 0
  },
  {
    "year": 1920,
    "description": "Nineteenth Amendment to the U.S. Constitution granted women the right to vote ",
    "height": 0
  },
  {
    "year": 1927,
    "description": "Nixon v. Herndon\n (Texas) struck down a 1923 Texas law that prohibited blacks from voting in the Democratic Party primary",
    "height": 0
  },
  {
    "year": 1932,
    "description": "Nixon v. Condon\n (Texas) declared that the prohibition of African Americans from the Democratic primaries by the executive committee was unconstitutional",
    "height": 0
  },
  {
    "year": 1935,
    "description": "Grovey v. Townsend\n (Texas) ruled that the members of the Democratic Party of Texas who assembled at a convention and made resolutions about those qualified to vote in the Democratic primary were a private group and that barring all but white citizens was not an act of the state and therefore not in violation of the Fourteenth and Fifteenth Amendments",
    "height": 0
  },
  {
    "year": 1935,
    "description": "Pearson v. Murray\n (Maryland), Daniel Gaines Murray, an African American, was admitted to the University of Maryland Law School when the Maryland Court of Appeals concluded that the state had failed to provide Murray with a separate but equal education",
    "height": 1
  },
  {
    "year": 1938,
    "description": "Missouri ex. rel. Gaines v. Canada\n (Missouri), the Supreme Court held that states providing a law school for white students were constitutionally required to provide in-state education for African American students as well, either by integrating the state law school or creating a separate school for African Americans",
    "height": 0
  },
  {
    "year": 1939,
    "description": "Creation of the Civil Liberties Unit, later renamed the Civil Rights Section of the Department of Justice, the first federal entity tasked with the protection of civil rights since Reconstruction",
    "height": 0
  },
  {
    "year": 1941,
    "description": "Executive Order 8802 prohibited racial discrimination in the national defense industry in response to the intended first March on Washington (Roosevelt)",
    "height": 0
  },
  {
    "year": 1942,
    "description": "Executive Order 9066 designated much of the West Coast a “military area” and ordered more than 100,000 Japanese Americans to relocate and live in internment camps (Roosevelt)",
    "height": 0
  },
  {
    "year": 1944,
    "description": "Smith v. Allwright\n (Texas) overturned the Democratic Party’s use of all-white primaries in Texas and other states",
    "height": 0
  },
  {
    "year": 1944,
    "description": "Korematsu v. United States\n (California) upheld the right to exclude Japanese Americans even though in a separate case, it found the relocation camps to be unconstitutional",
    "height": 1
  },
  {
    "year": 1944,
    "description": "Pollock v. Williams\n (Florida) reversed a decision that upheld Florida’s 1919 law facilitating debt peonage",
    "height": 2
  },
  {
    "year": 1946,
    "description": "Morgan v. Virginia\n found a Virginia law that required the races be separated in all intrastate and interstate travel unconstitutional",
    "height": 0
  },
  {
    "year": 1948,
    "description": "Shelley v. Kraemer\n (Missouri) held that courts could not enforce racially restrictive covenants on real estate that prevented “people of Negro or Mongolian race” from buying or living in certain neighborhoods",
    "height": 0
  },
  {
    "year": 1948,
    "description": "Perez v. Sharp\n (California) was the first case in which a court invalidated a ban on interracial marriage when the California Supreme Court concluded that the ban violated the Fourteenth Amendment to the United States Constitution",
    "height": 1
  },
  {
    "year": 1948,
    "description": "Executive Order 9980 prohibited discrimination in civilian agencies and instituted fair employment practices (Truman)",
    "height": 2
  },
  {
    "year": 1948,
    "description": "Executive Order 9981 abolished racial discrimination in the armed forces (Truman)",
    "height": 3
  },
  {
    "year": 1951,
    "description": "Executive Order 10308 created Committee on Government Compliance to enforce the prohibition against employment discrimination by firms contracting or subcontracting government orders (Truman)",
    "height": 0
  },
  {
    "year": 1953,
    "description": "Executive Order 10479 created the Government Contract Committee to replace the Committee on Government Compliance (Eisenhower)",
    "height": 0
  },
  {
    "year": 1954,
    "description": "Brown v. Board of Education of Topeka, Kansas\n, held that public education and segregation of children in public schools solely on the basis of race, even though the physical facilities and other tangible factors were equal, deprived equal educational opportunities to children of the minority group",
    "height": 0
  },
  {
    "year": 1955,
    "description": "Brown v. Board of Education of Topeka, Kansas II\n stated that Southern schools should comply with \nBrown I\n “with all deliberate speed,” which white Southerners understood as allowing them to resist and only symbolically comply with school desegregation",
    "height": 0
  },
  {
    "year": 1957,
    "description": "The Civil Rights Act of 1957 established the Civil Rights Commission (CRC) to protect an individual’s rights to equal protection and protected some civil and voting rights, but it lacked substantial enforcement mechanisms",
    "height": 0
  },
  {
    "year": 1960,
    "description": "The Civil Rights Act of 1960 guaranteed qualified voters the right to register to vote in any state and the right to sue a state official or acting state official who prevented them from voting",
    "height": 0
  },
  {
    "year": 1961,
    "description": "Executive Order 10925 created the Committee on Equal Opportunity to combat discrimination in government employment and in private employment stemming from government contracts (Kennedy)",
    "height": 0
  },
  {
    "year": 1961,
    "description": "Monroe v. Pape\n revitalized Section 1983 of the Civil Rights Act of 1871, by allowing individuals to sue government actors for violations of civil rights",
    "height": 1
  },
  {
    "year": 1962,
    "description": "Executive Order 11063 banned racial discrimination in federally funded housing (Kennedy)",
    "height": 0
  },
  {
    "year": 1963,
    "description": "Equal Pay Act required employers to pay all employees equally for equal work, regardless of whether the employees are male or female",
    "height": 0
  },
  {
    "year": 1963,
    "description": "Executive Order 11114 extended guarantees against employment discrimination to federally assisted contracts in the construction industry (Kennedy)",
    "height": 1
  },
  {
    "year": 1964,
    "description": "Civil Rights Act of 1964 prohibited discrimination in public accommodations and employment; authorized the attorney general to bring school desegregation suits and the federal government to withdraw funds from schools and other governmental entities receiving federal funds if they discriminated; and provided enhanced enforcement mechanisms for protecting civil and voting rights",
    "height": 0
  },
  {
    "year": 1964,
    "description": "Twenty-fourth Amendment to the U.S. Constitution eliminated poll taxes in federal elections",
    "height": 1
  },
  {
    "year": 1965,
    "description": "Voting Rights Act of 1965 enforced the Fifteenth Amendment to the U.S. Constitution and provided for substantial federal supervision of voting and election procedures in order to eliminate racial discrimination and protect the right to vote",
    "height": 0
  },
  {
    "year": 1965,
    "description": "Older Americans Act of 1965 provided assistance in the development of new or improved programs to help older persons through grants to the states for community planning and services and for training through research, development, or training project grants—and to establish within the Department of Health, Education and Welfare an operating agency to be designated as the Administration on Aging",
    "height": 1
  },
  {
    "year": 1965,
    "description": "Medicare Act provided a hospital insurance program for the aged under the Social Security Act with a supplementary medical benefits program and an expanded program of medical assistance to increase benefits under the Old-Age, Survivors, and Disability Insurance System and improved the federal-state public assistance programs",
    "height": 2
  },
  {
    "year": 1965,
    "description": "Act to Amend the Vocational Rehabilitation Act assisted in providing more flexibility in the financing and administration of state rehabilitation programs and expanded and improved services and facilities provided under such programs, particularly for the mentally disabled",
    "height": 3
  },
  {
    "year": 1965,
    "description": "Executive Order 11246 authorized federal agencies to enforce the Civil Rights Act of 1964 (Johnson)",
    "height": 4
  },
  {
    "year": 1966,
    "description": "Harper v. Virginia Board of Elections\n found Virginia’s poll tax unconstitutional under the equal protection clause of the Fourteenth Amendment, making poll taxes illegal for state and federal elections",
    "height": 0
  },
  {
    "year": 1966,
    "description": "Executive Order 11375 added sex discrimination to the enforcement of the Civil Rights Act of 1964 as required by Executive Order 11246 (Johnson)",
    "height": 1
  },
  {
    "year": 1967,
    "description": "Age Discrimination in Employment Act of 1967 prohibited arbitrary age discrimination in employment and helped employers and workers find ways of meeting problems arising from the impact of age on employment",
    "height": 0
  },
  {
    "year": 1968,
    "description": "Civil Rights Act of 1968 provided for equal housing opportunities regardless of race, creed, or national origin and made it a federal crime to injure or intimidate anyone because of their race, color, religion, or national origin",
    "height": 0
  },
  {
    "year": 1968,
    "description": "Jones v. Alfred H. Mayer Co\n. (Missouri) prohibited purely private discrimination in the sale or rental of property",
    "height": 1
  },
  {
    "year": 1968,
    "description": "Green et. al. v. County School Board of New Kent County\n (Virginia) reversed the decision of the Virginia Court of Appeals that supported separate schools for whites and blacks",
    "height": 2
  },
  {
    "year": 1969,
    "description": "Executive Order 11478 required equal opportunity and affirmative action programs in all federal agencies (Nixon)",
    "height": 0
  },
  {
    "year": 1972,
    "description": "The Equal Opportunity Act amended the Civil Rights Act of 1964 to apply to local, state, and federal governments and allow the Equal Employment Opportunity Commission to bring suits itself",
    "height": 0
  },
  {
    "year": 1973,
    "description": "Vocational Rehabilitation Act of 1973 prohibited discrimination on the basis of disability in federal programs, federal contractors, programs receiving federal money, and federal employment",
    "height": 0
  },
  {
    "year": 1973,
    "description": "Keyes v. Denver School District\n (Colorado) distinguished between \nde jure\n (sanctioned by law) and \nde facto\n (true in fact but not officially sanctioned) school segregation",
    "height": 1
  },
  {
    "year": 1973,
    "description": "San Antonio Independent School District v. Rodriguez\n (Texas) held that there was no constitutional violation in unequal school funding and ruled that education is not a fundamental right",
    "height": 2
  },
  {
    "year": 1973,
    "description": "Milliken v. Bradley\n (Michigan) found that \nde jure\n segregation in one school district could not justify busing children to and from surrounding school districts",
    "height": 3
  },
  {
    "year": 1975,
    "description": "Education for All Handicapped Children Act required all public schools accepting federal funds to provide equal access to education and one free meal per day for children with physical and mental disabilities",
    "height": 0
  },
  {
    "year": 1975,
    "description": "Age Discrimination Act of 1975 amended the Older Americans Act of 1965 to establish social services programs for older Americans to extend the authorizations of appropriations contained in such act, and to prohibit discrimination on the basis of age",
    "height": 1
  },
  {
    "year": 1976,
    "description": "Hills v. Gautreau\n (Illinois) determined that HUD had provided financial assistance to the Chicago Housing Authority, which had used the funds in a racially discriminatory way, violating Title VI and the 5th Amendment; HUD’s violation authorized the judiciary to require a remedy that extended beyond the city of Chicago",
    "height": 0
  },
  {
    "year": 1978,
    "description": "Pregnancy Discrimination Act of 1978 prohibited employment discrimination against female workers who are (or intend to become) pregnant, including discrimination in hiring, failure to promote, and wrongful termination after the Supreme Court held in 1974 that pregnancy discrimination was not a form of sex discrimination",
    "height": 0
  },
  {
    "year": 1978,
    "description": "Regents of the University of California v. Bakke\n (California) determined that college admission standards giving preferential consideration to minority applicants are constitutional",
    "height": 1
  },
  {
    "year": 1990,
    "description": "Americans with Disabilities Act established a clear and comprehensive prohibition of discrimination on the basis of disability",
    "height": 0
  },
  {
    "year": 1991,
    "description": "Civil Rights Act of 1991 superseded several narrowing U.S. Supreme Court civil rights decisions and granted women and disabled persons the right to recover money damages under Title VII of the Civil Rights Act of 1964",
    "height": 0
  },
  {
    "year": 1993,
    "description": "“Don’t Ask Don’t Tell” policy prohibited military personnel from discriminating against or harassing closeted gay, lesbian, or bisexual service members or applicants while barring openly gay, lesbian, or bisexual Americans from military service",
    "height": 0
  },
  {
    "year": 1993,
    "description": "Family and Medical Leave Act gave employees the right to take (unpaid) time off from work in order to care for a newborn or recently adopted child or to look after an ill family member",
    "height": 1
  },
  {
    "year": 2009,
    "description": "Lilly Ledbetter Fair Pay Act of 2009 clarified that a discriminatory compensation decision or other practice that is unlawful occurs each time compensation is paid pursuant to the discriminatory compensation decision or other practices and thereby extends the time in which an employee can bring a lawsuit",
    "height": 0
  },
  {
    "year": 2010,
    "description": "Don’t Ask, Don’t Tell Repeal Act of 2010 allowed openly gay, lesbian, and bisexual Americans to serve without discrimination in the armed forces",
    "height": 0
  },
  {
    "year": 2013,
    "description": "United States v. Windsor\n (New York) determined the Defense of Marriage Act’s definition of “marriage” and “spouse” as limited to heterosexual unions unconstitutional, thus enabling same-sex couples to receive federal benefits",
    "height": 0
  },
  {
    "year": 2013,
    "description": "Shelby County v. Holder\n (Alabama) invalidated Section 4 of the Voting Rights Act, which provided for preclearance for any change to voting rules in particular jurisdictions ",
    "height": 1
  },
  {
    "year": 2014,
    "description": "Schuette v. Coalition to Defend Affirmative Action\n upheld a Michigan referendum banning affirmative action in admissions at publicly funded state colleges.",
    "height": 0
  }
]